final List<Map<String, dynamic>> azkarList = [
  {"title": "سُبْحَانَ اللَّهِ", "count": 0},
  {"title": "الْحَمْدُ لِلَّهِ", "count": 0},
  {"title": "لَا إِلَهَ إِلَّا اللهُ", "count": 0},
  {"title": "اللهُ أَكْبَرُ", "count": 0},
  {
    "title": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ",
    "count": 0
  },
  {"title": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ", "count": 0},
  {"title": "سُبْحَانَ اللَّهِ الْعَظِيمِ", "count": 0},
  {"title": "اللَّهُـمَّ اغْفِرْ لِي وَارْحَمْنِي", "count": 0},
  {
    "title": "اللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ العَفْوَ فَاعْفُ عَنِّي",
    "count": 0
  },
  {
    "title":
        "لَا إِلَهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ",
    "count": 0
  },
  {
    "title": "سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَاللَّهُ أَكْبَرُ",
    "count": 0
  },
  {
    "title":
        "اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلَّا أَنتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ",
    "count": 0
  },
  {
    "title":
        "حَسْبِيَ اللَّهُ لَا إِلَهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ العَرْشِ العَظِيمِ",
    "count": 0
  },
  {
    "title":
        "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ المُلكُ وَلَهُ الحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
    "count": 0
  },
  {
    "title": "اللَّهُمَّ يَا مُقَلِّبَ القُلُوبِ ثَبِّتْ قَلْبِي عَلَى دِينِكَ",
    "count": 0
  },
  {
    "title": "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ عَلَى نَبِيِّنَا مُحَمَّدٍ",
    "count": 0
  },
  {
    "title":
        "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ فِي الأَوَّلِينَ وَالآخِرِينَ",
    "count": 0
  },
  {
    "title":
        "اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ. اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ، إِنَّكَ حَمِيدٌ مَجِيدٌ.",
    "count": 0
  },
  {"title": "الحمد لله عدد ما خلق", "count": 0},
  {"title": "الحمد لله ملء ما خلق", "count": 0},
  {"title": "الحمد لله عدد ما في السماوات وما في الأرض", "count": 0},
  {"title": "الحمد لله عدد ما أحصى كتابه", "count": 0},
  {"title": "الحمد لله عدد كل شيء", "count": 0},
  {"title": "الحمد لله ملء كل شيء", "count": 0},
  {"title": "سبحان الله عدد ما خلق", "count": 0},
  {"title": "سبحان الله ملء ما خلق", "count": 0},
  {"title": "سبحان الله عدد ما في السماوات وما في الأرض", "count": 0},
  {"title": "سبحان الله عدد كل شيء", "count": 0},
  {"title": "سبحان الله ملء كل شيء", "count": 0},
  {"title": "الله أكبر عدد ما خلق", "count": 0},
  {"title": "الله أكبر ملء ما خلق", "count": 0},
  {"title": "الله أكبر عدد ما في السماوات وما في الأرض", "count": 0},
  {"title": "الله أكبر ملء كل شيء", "count": 0},
  {"title": "لَا إِلَهَ إِلَّا اللَّهُ عَدَدَ مَا خَلَقَ", "count": 0},
  {"title": "لَا إِلَهَ إِلَّا اللَّهُ مِلْءَ مَا خَلَقَ", "count": 0},
  {
    "title":
        "لَا إِلَهَ إِلَّا اللَّهُ عَدَدَ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ",
    "count": 0
  },
  {"title": "لَا إِلَهَ إِلَّا اللَّهُ زِنَةَ عَرْشِهِ", "count": 0},
  {"title": "لَا إِلَهَ إِلَّا اللَّهُ مِدَادَ كَلِمَاتِهِ", "count": 0},
  {"title": "أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ", "count": 0},
  {
    "title":
        "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ عَدَدَ خَلْقِهِ وَرِضَا نَفْسِهِ وَزِنَةَ عَرْشِهِ وَمِدَادَ كَلِمَاتِهِ",
    "count": 0
  },
  {"title": "رَبِّ اغْفِرْ لِي", "count": 0},
  {
    "title":
        "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ، أَصْلِحْ لِي شَأْنِي كُلَّهُ، وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ",
    "count": 0
  },
  {
    "title":
        "اللَّهُمَّ إِنِّي أَسْأَلُكَ رِضَاكَ وَالجَنَّةَ، وَأَعُوذُ بِكَ مِنْ سَخَطِكَ وَالنَّارِ",
    "count": 0
  },
  {
    "title":
        "اللَّهُمَّ اجعلني لك ذَكَّاراً، لك شَكَّاراً، لك رَهَّاباً، لك مِطواعاً، إليك أَوَّاهًا مُنيباً",
    "count": 0
  },
  {"title": "رَبِّ زِدْنِي عِلْمًا", "count": 0},
  {
    "title":
        "اللَّهُمَّ طَهِّر قَلْبِي مِنَ النِّفَاقِ وَعَمَلِي مِنَ الرِّيَاءِ",
    "count": 0
  },
  {
    "title": "اللَّهُمَّ اجعل القرآن رَبِيعَ قَلْبِي وَنُورَ صَدْرِي",
    "count": 0
  },
  {"title": "اللَّهُمَّ ارزقني حُسن الخاتمة", "count": 0},
  {"title": "اللَّهُمَّ ثَبِّتْنِي عِندَ السُّؤَال", "count": 0},
  {
    "title":
        "اللَّهُمَّ آتِ نَفْسِي تَقْوَاهَا وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا",
    "count": 0
  },
  {"title": "اللَّهُمَّ اجعل قبري رَوْضَةً مِنْ رِيَاضِ الجَنَّةِ", "count": 0},
  {"title": "اللَّهُ أَكْبَرُ كَبِيرًا", "count": 0},
  {"title": "الحَمْدُ لِلَّهِ كَثِيرًا", "count": 0},
  {"title": "سُبْحَانَ اللَّهِ بُكْرَةً وَأَصِيلًا", "count": 0},
  {"title": "رَضِيتُ بِاللَّهِ رَبًّا", "count": 0},
  {"title": "رَضِيتُ بِالإِسْلاَمِ دِينًا", "count": 0},
  {"title": "رَضِيتُ بِمُحَمَّدٍ نَبِيًّا", "count": 0},
  {"title": "اللَّهُمَّ زِدْنِي إِيمَانًا", "count": 0},
  {"title": "اللَّهُمَّ زِدْنِي هُدًى", "count": 0},
];
