final List<String> azkarShukrDhikr = [
  "اللهم اجعلنا من الشاكرين، واجعلنا من الذاكرين.",
  "اللهم اجعلنا من أهل الذكر الذين لا يشق عليهم الذكر، ولا يهلكهم النسيان.",
  "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ، سُبْحَانَ اللَّهِ الْعَظِيمِ.",
  "اللهم إني أشهدك أنني أشكر نعمتك عليَّ، وأحمدك على ما أنعمت به عليّ من نعم كثيرة.",
  "اللهم لا تَمْنَعْنَا من فضلك ورحمتك، بل اجعلنا من الشاكرين الذاكرين.",
  "اللهم إني أعوذ بك أن أكون من الذين نسوا ذكرك.",
  "رَبِّ اجْعَلْنِي لَكَ شَاكِرًا، لَا تَقْتِرْ عَلَيَّ الرَّحْمَةَ، وَجَعَلْنِي مِنَ الذاكِرِينَ لَك.",
  "اللهم ارزقنا لذة الشكر على نعمتك، وذكرك آناء الليل وآناء النهار.",
  "أشهد أن لا إله إلا الله، وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير.",
  "اللهم لك الحمد على نعمتك التي لا تحصى، والشكر لك على ما أنعمت به عليّ من فضل وكرم."
];
