final List<String> azkarHome = [
  "بِسْمِ اللهِ وَلَجْنـا، وَبِسْمِ اللهِ خَـرَجْنـا، وَعَلـى رَبِّنـا تَوَكّلْـنا.",
  "بِسْمِ اللهِ، تَوَكَّلْـتُ عَلى اللهِ، وَلا حَوْلَ وَلا قُـوَّةَ إِلاّ بِالله.",
  "عن أم سلمة رضي الله عنها، قالت: مَا خَرَجَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ بَيْتِي قَطُّ إِلَّا رَفَعَ طَرْفَهُ إِلَى السَّمَاءِ فَقَالَ اللَّهُمَّ أَعُوذُ بِكَ أَنْ أَضِلَّ أَوْ أُضَلَّ أَوْ أَزِلَّ أَوْ أُزَلَّ أَوْ أَظْلِمَ أَوْ أُظْلَمَ أَوْ أَجْهَلَ أَوْ يُجْهَلَ عَلَيَّ",
];
