final List<Map<String, dynamic>> azkarList = [
  {"title": "سُبْحَانَ اللَّهِ", "count": 0},
  {"title": "الْحَمْدُ لِلَّهِ", "count": 0},
  {"title": "لَا إِلَهَ إِلَّا اللهُ", "count": 0},
  {"title": "اللهُ أَكْبَرُ", "count": 0},
  {
    "title": "لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ",
    "count": 0
  },
  {"title": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ", "count": 0},
  {"title": "سُبْحَانَ اللَّهِ الْعَظِيمِ", "count": 0},
  {"title": "اللَّهُـمَّ اغْفِرْ لِي وَارْحَمْنِي", "count": 0},
  {
    "title": "اللَّهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ العَفْوَ فَاعْفُ عَنِّي",
    "count": 0
  },
  {
    "title":
        "لَا إِلَهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ",
    "count": 0
  },
  {
    "title": "سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَاللَّهُ أَكْبَرُ",
    "count": 0
  },
  {
    "title":
        "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ المُلكُ وَلَهُ الحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
    "count": 0
  },
  {
    "title": "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ عَلَى نَبِيِّنَا مُحَمَّدٍ",
    "count": 0
  },
  {
    "title": "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ",
    "count": 0
  },
  {
    "title":
        "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ فِي الأَوَّلِينَ وَالآخِرِينَ",
    "count": 0
  },
  {
    "title":
        "اللَّهُمَّ صَلِّ وَسَلِّمْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ",
    "count": 0
  },
  {
    "title":
        "اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ",
    "count": 0
  },
  {"title": "أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ", "count": 0},
  {
    "title":
        "يَا حَيُّ يَا قَيُّومُ بِرَحْمَتِكَ أَسْتَغِيثُ، أَصْلِحْ لِي شَأْنِي كُلَّهُ، وَلَا تَكِلْنِي إِلَى نَفْسِي طَرْفَةَ عَيْنٍ",
    "count": 0
  },
  {
    "title":
        "اللَّهُمَّ إِنِّي أَسْأَلُكَ رِضَاكَ وَالجَنَّةَ، وَأَعُوذُ بِكَ مِنْ سَخَطِكَ وَالنَّارِ",
    "count": 0
  },
];
